Revit 2027 API
ParameterTypeId.ViewSolarstudySingledayDatetimeText Property
 "Single day date and time text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudySingledayDatetimeText { get; }
Public Shared ReadOnly Property ViewSolarstudySingledayDatetimeText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudySingledayDatetimeText {
	ForgeTypeId^ get ();
}
static member ViewSolarstudySingledayDatetimeText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace